Revit 2027 API
CableSize.Comments Property
 The comments of this Cable Size.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Comments { get; set; }
Public Property Comments As String
	Get
	Set
public:
property String^ Comments {
	String^ get ();
	void set (String^ value);
}
member Comments : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace